Autodesk.Revit.DB.ReferencePlane.Reference
The geometry reference of the reference plane.

Autodesk.Revit.DB.ReferencePlane.Plane
The geometry plane to which the reference plane is assigned.

Autodesk.Revit.DB.ReferencePlane.Direction
The direction of the reference plane.
Remarks: When setting this property, an exception will be thrown if the direction vector is almost zero
or if it is not perpendicular to the normal vector.

Autodesk.Revit.DB.ReferencePlane.FreeEnd
The free end of the reference plane.
Remarks: When setting this property, an exception will be thrown if the free end is set to
almost the same point as bubble end or if the vector from BubbleEnd -> FreeEnd is not perpendicular
to the normal vector.

Autodesk.Revit.DB.ReferencePlane.BubbleEnd
The bubble end of the reference plane.
Remarks: When setting this property, an exception will be thrown if the bubble end is set to almost
the same point as free end or if the vector from BubbleEnd -> FreeEnd
is not perpendicular to the normal vector.